-- phpMyAdmin SQL Dump
-- version 4.9.5deb2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Июл 15 2023 г., 09:53
-- Версия сервера: 8.0.33-0ubuntu0.20.04.2
-- Версия PHP: 7.4.3-4ubuntu2.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test`
--

-- --------------------------------------------------------

--
-- Структура таблицы `regions`
--

CREATE TABLE `regions` (
  `id` int NOT NULL,
  `name` varchar(100) NOT NULL,
  `travel_time` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `regions`
--

INSERT INTO `regions` (`id`, `name`, `travel_time`) VALUES
(1, 'Санкт-Петербург', 3),
(2, 'Уфа', 2),
(3, 'Нижний Новгород', 2),
(4, 'Владимир', 1),
(5, 'Кострома', 1),
(6, 'Екатеринбург', 4),
(7, 'Ковров', 1),
(8, 'Воронеж', 2),
(9, 'Самара', 3),
(10, 'Астрахань', 4);

-- --------------------------------------------------------

--
-- Структура таблицы `trips`
--

CREATE TABLE `trips` (
  `id` int NOT NULL,
  `region_id` int NOT NULL,
  `departure_date` date NOT NULL,
  `courier_name` varchar(100) NOT NULL,
  `arrival_date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `trips`
--

INSERT INTO `trips` (`id`, `region_id`, `departure_date`, `courier_name`, `arrival_date`) VALUES
(2796, 1, '2023-07-15', 'Сергей Попов', '2023-07-18'),
(2797, 2, '2023-07-16', 'Сергей Попов', '2023-07-18'),
(2798, 3, '2023-07-17', 'Анна Михайлова', '2023-07-19'),
(2799, 4, '2023-07-18', 'Сергей Попов', '2023-07-19'),
(2800, 5, '2023-07-19', 'Сергей Попов', '2023-07-20'),
(2801, 6, '2023-07-20', 'Алексей Смирнов', '2023-07-24'),
(2802, 7, '2023-07-21', 'Мария Сидорова', '2023-07-22'),
(2803, 8, '2023-07-22', 'Ольга Лебедева', '2023-07-24'),
(2804, 9, '2023-07-23', 'Петр Петров', '2023-07-26'),
(2805, 10, '2023-07-24', 'Елена Ковалева', '2023-07-28'),
(2806, 1, '2023-07-25', 'Сергей Попов', '2023-07-28'),
(2807, 2, '2023-07-26', 'Елена Ковалева', '2023-07-28'),
(2808, 3, '2023-07-27', 'Ольга Лебедева', '2023-07-29'),
(2809, 4, '2023-07-28', 'Артем Николаев', '2023-07-29'),
(2810, 5, '2023-07-29', 'Мария Сидорова', '2023-07-30'),
(2811, 6, '2023-07-30', 'Иван Иванов', '2023-08-03'),
(2812, 7, '2023-07-31', 'Сергей Попов', '2023-08-01'),
(2813, 8, '2023-08-01', 'Ольга Лебедева', '2023-08-03'),
(2814, 9, '2023-08-02', 'Анна Михайлова', '2023-08-05'),
(2815, 10, '2023-08-03', 'Иван Иванов', '2023-08-07'),
(2816, 1, '2023-08-04', 'Дмитрий Федоров', '2023-08-07'),
(2817, 2, '2023-08-05', 'Елена Ковалева', '2023-08-07'),
(2818, 3, '2023-08-06', 'Елена Ковалева', '2023-08-08'),
(2819, 4, '2023-08-07', 'Иван Иванов', '2023-08-08'),
(2820, 5, '2023-08-08', 'Алексей Смирнов', '2023-08-09'),
(2821, 6, '2023-08-09', 'Алексей Смирнов', '2023-08-13'),
(2822, 7, '2023-08-10', 'Артем Николаев', '2023-08-11'),
(2823, 8, '2023-08-11', 'Мария Сидорова', '2023-08-13'),
(2824, 9, '2023-08-12', 'Артем Николаев', '2023-08-15'),
(2825, 10, '2023-08-13', 'Анна Михайлова', '2023-08-17'),
(2826, 1, '2023-08-14', 'Елена Ковалева', '2023-08-17'),
(2827, 2, '2023-08-15', 'Анна Михайлова', '2023-08-17'),
(2828, 3, '2023-08-16', 'Дмитрий Федоров', '2023-08-18'),
(2829, 4, '2023-08-17', 'Артем Николаев', '2023-08-18'),
(2830, 5, '2023-08-18', 'Елена Ковалева', '2023-08-19'),
(2831, 6, '2023-08-19', 'Иван Иванов', '2023-08-23'),
(2832, 7, '2023-08-20', 'Мария Сидорова', '2023-08-21'),
(2833, 8, '2023-08-21', 'Анна Михайлова', '2023-08-23'),
(2834, 9, '2023-08-22', 'Анна Михайлова', '2023-08-25'),
(2835, 10, '2023-08-23', 'Иван Иванов', '2023-08-27'),
(2836, 1, '2023-08-24', 'Артем Николаев', '2023-08-27'),
(2837, 2, '2023-08-25', 'Ольга Лебедева', '2023-08-27'),
(2838, 3, '2023-08-26', 'Анна Михайлова', '2023-08-28'),
(2839, 4, '2023-08-27', 'Петр Петров', '2023-08-28'),
(2840, 5, '2023-08-28', 'Артем Николаев', '2023-08-29'),
(2841, 6, '2023-08-29', 'Иван Иванов', '2023-09-02'),
(2842, 7, '2023-08-30', 'Артем Николаев', '2023-08-31'),
(2843, 8, '2023-08-31', 'Иван Иванов', '2023-09-02'),
(2844, 9, '2023-09-01', 'Петр Петров', '2023-09-04'),
(2845, 10, '2023-09-02', 'Анна Михайлова', '2023-09-06'),
(2846, 1, '2023-09-03', 'Сергей Попов', '2023-09-06'),
(2847, 2, '2023-09-04', 'Сергей Попов', '2023-09-06'),
(2848, 3, '2023-09-05', 'Дмитрий Федоров', '2023-09-07'),
(2849, 4, '2023-09-06', 'Анна Михайлова', '2023-09-07'),
(2850, 5, '2023-09-07', 'Анна Михайлова', '2023-09-08'),
(2851, 6, '2023-09-08', 'Елена Ковалева', '2023-09-12'),
(2852, 7, '2023-09-09', 'Дмитрий Федоров', '2023-09-10'),
(2853, 8, '2023-09-10', 'Алексей Смирнов', '2023-09-12'),
(2854, 9, '2023-09-11', 'Ольга Лебедева', '2023-09-14'),
(2855, 10, '2023-09-12', 'Анна Михайлова', '2023-09-16'),
(2856, 1, '2023-09-13', 'Елена Ковалева', '2023-09-16'),
(2857, 2, '2023-09-14', 'Сергей Попов', '2023-09-16'),
(2858, 3, '2023-09-15', 'Дмитрий Федоров', '2023-09-17'),
(2859, 4, '2023-09-16', 'Мария Сидорова', '2023-09-17'),
(2860, 5, '2023-09-17', 'Иван Иванов', '2023-09-18'),
(2861, 6, '2023-09-18', 'Артем Николаев', '2023-09-22'),
(2862, 7, '2023-09-19', 'Сергей Попов', '2023-09-20'),
(2863, 8, '2023-09-20', 'Иван Иванов', '2023-09-22'),
(2864, 9, '2023-09-21', 'Петр Петров', '2023-09-24'),
(2865, 10, '2023-09-22', 'Петр Петров', '2023-09-26'),
(2866, 1, '2023-09-23', 'Анна Михайлова', '2023-09-26'),
(2867, 2, '2023-09-24', 'Артем Николаев', '2023-09-26'),
(2868, 3, '2023-09-25', 'Анна Михайлова', '2023-09-27'),
(2869, 4, '2023-09-26', 'Мария Сидорова', '2023-09-27'),
(2870, 5, '2023-09-27', 'Дмитрий Федоров', '2023-09-28'),
(2871, 6, '2023-09-28', 'Дмитрий Федоров', '2023-10-02'),
(2872, 7, '2023-09-29', 'Ольга Лебедева', '2023-09-30'),
(2873, 8, '2023-09-30', 'Иван Иванов', '2023-10-02'),
(2874, 9, '2023-10-01', 'Дмитрий Федоров', '2023-10-04'),
(2875, 10, '2023-10-02', 'Мария Сидорова', '2023-10-06'),
(2876, 1, '2023-10-03', 'Ольга Лебедева', '2023-10-06'),
(2877, 2, '2023-10-04', 'Мария Сидорова', '2023-10-06'),
(2878, 3, '2023-10-05', 'Ольга Лебедева', '2023-10-07'),
(2879, 4, '2023-10-06', 'Алексей Смирнов', '2023-10-07'),
(2880, 5, '2023-10-07', 'Сергей Попов', '2023-10-08'),
(2881, 6, '2023-10-08', 'Мария Сидорова', '2023-10-12'),
(2882, 7, '2023-10-09', 'Сергей Попов', '2023-10-10'),
(2883, 8, '2023-10-10', 'Ольга Лебедева', '2023-10-12'),
(2884, 9, '2023-10-11', 'Петр Петров', '2023-10-14'),
(2885, 10, '2023-10-12', 'Сергей Попов', '2023-10-16'),
(2886, 1, '2023-10-13', 'Мария Сидорова', '2023-10-16'),
(2887, 2, '2023-10-14', 'Ольга Лебедева', '2023-10-16'),
(2888, 3, '2023-10-15', 'Мария Сидорова', '2023-10-17'),
(2889, 4, '2023-10-16', 'Дмитрий Федоров', '2023-10-17'),
(2890, 5, '2023-10-17', 'Елена Ковалева', '2023-10-18'),
(2891, 6, '2023-10-18', 'Ольга Лебедева', '2023-10-22'),
(2892, 7, '2023-10-19', 'Сергей Попов', '2023-10-20'),
(2893, 8, '2023-10-20', 'Алексей Смирнов', '2023-10-22'),
(2894, 9, '2023-10-21', 'Анна Михайлова', '2023-10-24'),
(2895, 10, '2023-10-22', 'Сергей Попов', '2023-10-26'),
(2896, 1, '2023-07-15', 'Анна Михайлова', '2023-07-18'),
(2897, 2, '2023-07-16', 'Ольга Лебедева', '2023-07-18'),
(2898, 3, '2023-07-17', 'Елена Ковалева', '2023-07-19'),
(2899, 5, '2023-07-19', 'Алексей Смирнов', '2023-07-20'),
(2900, 6, '2023-07-20', 'Петр Петров', '2023-07-24'),
(2901, 7, '2023-07-21', 'Петр Петров', '2023-07-22'),
(2902, 8, '2023-07-22', 'Мария Сидорова', '2023-07-24'),
(2903, 9, '2023-07-23', 'Алексей Смирнов', '2023-07-26'),
(2904, 10, '2023-07-24', 'Артем Николаев', '2023-07-28'),
(2905, 1, '2023-07-25', 'Ольга Лебедева', '2023-07-28'),
(2906, 2, '2023-07-26', 'Артем Николаев', '2023-07-28'),
(2907, 3, '2023-07-27', 'Артем Николаев', '2023-07-29'),
(2908, 4, '2023-07-28', 'Сергей Попов', '2023-07-29'),
(2909, 6, '2023-07-30', 'Мария Сидорова', '2023-08-03'),
(2910, 7, '2023-07-31', 'Мария Сидорова', '2023-08-01'),
(2911, 8, '2023-08-01', 'Дмитрий Федоров', '2023-08-03'),
(2912, 9, '2023-08-02', 'Сергей Попов', '2023-08-05'),
(2913, 10, '2023-08-03', 'Ольга Лебедева', '2023-08-07'),
(2914, 1, '2023-08-04', 'Петр Петров', '2023-08-07'),
(2915, 2, '2023-08-05', 'Сергей Попов', '2023-08-07'),
(2916, 3, '2023-08-06', 'Мария Сидорова', '2023-08-08'),
(2917, 4, '2023-08-07', 'Сергей Попов', '2023-08-08'),
(2918, 5, '2023-08-08', 'Артем Николаев', '2023-08-09'),
(2919, 6, '2023-08-09', 'Иван Иванов', '2023-08-13'),
(2920, 7, '2023-08-10', 'Сергей Попов', '2023-08-11'),
(2921, 8, '2023-08-11', 'Петр Петров', '2023-08-13'),
(2922, 9, '2023-08-12', 'Елена Ковалева', '2023-08-15'),
(2923, 10, '2023-08-13', 'Артем Николаев', '2023-08-17'),
(2924, 1, '2023-08-14', 'Дмитрий Федоров', '2023-08-17'),
(2925, 2, '2023-08-15', 'Артем Николаев', '2023-08-17'),
(2926, 3, '2023-08-16', 'Петр Петров', '2023-08-18'),
(2927, 4, '2023-08-17', 'Ольга Лебедева', '2023-08-18'),
(2928, 5, '2023-08-18', 'Артем Николаев', '2023-08-19'),
(2929, 6, '2023-08-19', 'Ольга Лебедева', '2023-08-23'),
(2930, 7, '2023-08-20', 'Анна Михайлова', '2023-08-21'),
(2931, 9, '2023-08-22', 'Елена Ковалева', '2023-08-25'),
(2932, 10, '2023-08-23', 'Сергей Попов', '2023-08-27'),
(2933, 1, '2023-08-24', 'Ольга Лебедева', '2023-08-27'),
(2934, 2, '2023-08-25', 'Артем Николаев', '2023-08-27'),
(2935, 3, '2023-08-26', 'Ольга Лебедева', '2023-08-28'),
(2936, 4, '2023-08-27', 'Елена Ковалева', '2023-08-28'),
(2937, 5, '2023-08-28', 'Дмитрий Федоров', '2023-08-29'),
(2938, 6, '2023-08-29', 'Петр Петров', '2023-09-02'),
(2939, 7, '2023-08-30', 'Ольга Лебедева', '2023-08-31'),
(2940, 8, '2023-08-31', 'Елена Ковалева', '2023-09-02'),
(2941, 9, '2023-09-01', 'Мария Сидорова', '2023-09-04'),
(2942, 10, '2023-09-02', 'Мария Сидорова', '2023-09-06'),
(2943, 1, '2023-09-03', 'Мария Сидорова', '2023-09-06'),
(2944, 2, '2023-09-04', 'Дмитрий Федоров', '2023-09-06'),
(2945, 3, '2023-09-05', 'Артем Николаев', '2023-09-07'),
(2946, 4, '2023-09-06', 'Ольга Лебедева', '2023-09-07'),
(2947, 5, '2023-09-07', 'Иван Иванов', '2023-09-08'),
(2948, 6, '2023-09-08', 'Дмитрий Федоров', '2023-09-12'),
(2949, 7, '2023-09-09', 'Елена Ковалева', '2023-09-10'),
(2950, 8, '2023-09-10', 'Петр Петров', '2023-09-12'),
(2951, 9, '2023-09-11', 'Анна Михайлова', '2023-09-14'),
(2952, 10, '2023-09-12', 'Петр Петров', '2023-09-16'),
(2953, 1, '2023-09-13', 'Сергей Попов', '2023-09-16'),
(2954, 2, '2023-09-14', 'Петр Петров', '2023-09-16'),
(2955, 3, '2023-09-15', 'Петр Петров', '2023-09-17'),
(2956, 4, '2023-09-16', 'Алексей Смирнов', '2023-09-17'),
(2957, 5, '2023-09-17', 'Ольга Лебедева', '2023-09-18'),
(2958, 6, '2023-09-18', 'Анна Михайлова', '2023-09-22'),
(2959, 7, '2023-09-19', 'Анна Михайлова', '2023-09-20'),
(2960, 8, '2023-09-20', 'Мария Сидорова', '2023-09-22'),
(2961, 9, '2023-09-21', 'Мария Сидорова', '2023-09-24'),
(2962, 10, '2023-09-22', 'Елена Ковалева', '2023-09-26'),
(2963, 1, '2023-09-23', 'Сергей Попов', '2023-09-26'),
(2964, 2, '2023-09-24', 'Сергей Попов', '2023-09-26'),
(2965, 3, '2023-09-25', 'Ольга Лебедева', '2023-09-27'),
(2966, 4, '2023-09-26', 'Ольга Лебедева', '2023-09-27'),
(2967, 5, '2023-09-27', 'Анна Михайлова', '2023-09-28'),
(2968, 7, '2023-09-29', 'Иван Иванов', '2023-09-30'),
(2969, 8, '2023-09-30', 'Елена Ковалева', '2023-10-02'),
(2970, 9, '2023-10-01', 'Анна Михайлова', '2023-10-04'),
(2971, 10, '2023-10-02', 'Сергей Попов', '2023-10-06'),
(2972, 1, '2023-10-03', 'Артем Николаев', '2023-10-06'),
(2973, 2, '2023-10-04', 'Дмитрий Федоров', '2023-10-06'),
(2974, 3, '2023-10-05', 'Дмитрий Федоров', '2023-10-07'),
(2975, 5, '2023-10-07', 'Алексей Смирнов', '2023-10-08'),
(2976, 6, '2023-10-08', 'Алексей Смирнов', '2023-10-12'),
(2977, 7, '2023-10-09', 'Иван Иванов', '2023-10-10'),
(2978, 8, '2023-10-10', 'Сергей Попов', '2023-10-12'),
(2979, 9, '2023-10-11', 'Анна Михайлова', '2023-10-14'),
(2980, 10, '2023-10-12', 'Ольга Лебедева', '2023-10-16'),
(2981, 1, '2023-10-13', 'Сергей Попов', '2023-10-16'),
(2982, 2, '2023-10-14', 'Мария Сидорова', '2023-10-16'),
(2983, 3, '2023-10-15', 'Иван Иванов', '2023-10-17'),
(2984, 4, '2023-10-16', 'Елена Ковалева', '2023-10-17'),
(2985, 5, '2023-10-17', 'Иван Иванов', '2023-10-18'),
(2986, 6, '2023-10-18', 'Дмитрий Федоров', '2023-10-22'),
(2987, 7, '2023-10-19', 'Иван Иванов', '2023-10-20'),
(2988, 8, '2023-10-20', 'Ольга Лебедева', '2023-10-22'),
(2989, 9, '2023-10-21', 'Иван Иванов', '2023-10-24'),
(2990, 10, '2023-10-22', 'Мария Сидорова', '2023-10-26'),
(2991, 1, '2023-07-15', 'Елена Ковалева', '2023-07-18'),
(2992, 2, '2023-07-16', 'Алексей Смирнов', '2023-07-18'),
(2993, 3, '2023-07-17', 'Артем Николаев', '2023-07-19'),
(2994, 4, '2023-07-18', 'Мария Сидорова', '2023-07-19'),
(2995, 6, '2023-07-20', 'Иван Иванов', '2023-07-24'),
(2996, 7, '2023-07-21', 'Сергей Попов', '2023-07-22'),
(2997, 8, '2023-07-22', 'Елена Ковалева', '2023-07-24'),
(2998, 9, '2023-07-23', 'Артем Николаев', '2023-07-26'),
(2999, 10, '2023-07-24', 'Мария Сидорова', '2023-07-28'),
(3000, 1, '2023-07-25', 'Мария Сидорова', '2023-07-28'),
(3001, 2, '2023-07-26', 'Алексей Смирнов', '2023-07-28'),
(3002, 3, '2023-07-27', 'Сергей Попов', '2023-07-29'),
(3003, 4, '2023-07-28', 'Алексей Смирнов', '2023-07-29'),
(3004, 5, '2023-07-29', 'Ольга Лебедева', '2023-07-30'),
(3005, 7, '2023-07-31', 'Артем Николаев', '2023-08-01'),
(3006, 8, '2023-08-01', 'Алексей Смирнов', '2023-08-03'),
(3007, 9, '2023-08-02', 'Ольга Лебедева', '2023-08-05'),
(3008, 1, '2023-08-04', 'Алексей Смирнов', '2023-08-07'),
(3009, 2, '2023-08-05', 'Ольга Лебедева', '2023-08-07'),
(3010, 3, '2023-08-06', 'Ольга Лебедева', '2023-08-08'),
(3011, 6, '2023-08-09', 'Сергей Попов', '2023-08-13'),
(3012, 8, '2023-08-11', 'Артем Николаев', '2023-08-13'),
(3013, 10, '2023-08-13', 'Елена Ковалева', '2023-08-17'),
(3014, 2, '2023-08-15', 'Мария Сидорова', '2023-08-17'),
(3015, 3, '2023-08-16', 'Иван Иванов', '2023-08-18'),
(3016, 4, '2023-08-17', 'Дмитрий Федоров', '2023-08-18'),
(3017, 5, '2023-08-18', 'Петр Петров', '2023-08-19'),
(3018, 6, '2023-08-19', 'Алексей Смирнов', '2023-08-23'),
(3019, 7, '2023-08-20', 'Ольга Лебедева', '2023-08-21'),
(3020, 8, '2023-08-21', 'Сергей Попов', '2023-08-23'),
(3021, 9, '2023-08-22', 'Артем Николаев', '2023-08-25'),
(3022, 10, '2023-08-23', 'Анна Михайлова', '2023-08-27'),
(3023, 1, '2023-08-24', 'Дмитрий Федоров', '2023-08-27'),
(3024, 2, '2023-08-25', 'Анна Михайлова', '2023-08-27'),
(3025, 3, '2023-08-26', 'Елена Ковалева', '2023-08-28'),
(3026, 4, '2023-08-27', 'Артем Николаев', '2023-08-28'),
(3027, 6, '2023-08-29', 'Сергей Попов', '2023-09-02'),
(3028, 7, '2023-08-30', 'Мария Сидорова', '2023-08-31'),
(3029, 8, '2023-08-31', 'Анна Михайлова', '2023-09-02'),
(3030, 9, '2023-09-01', 'Анна Михайлова', '2023-09-04'),
(3031, 10, '2023-09-02', 'Ольга Лебедева', '2023-09-06'),
(3032, 1, '2023-09-03', 'Анна Михайлова', '2023-09-06'),
(3033, 2, '2023-09-04', 'Мария Сидорова', '2023-09-06'),
(3034, 4, '2023-09-06', 'Елена Ковалева', '2023-09-07'),
(3035, 5, '2023-09-07', 'Алексей Смирнов', '2023-09-08'),
(3036, 6, '2023-09-08', 'Иван Иванов', '2023-09-12'),
(3037, 7, '2023-09-09', 'Анна Михайлова', '2023-09-10'),
(3038, 8, '2023-09-10', 'Дмитрий Федоров', '2023-09-12'),
(3039, 9, '2023-09-11', 'Елена Ковалева', '2023-09-14'),
(3040, 10, '2023-09-12', 'Иван Иванов', '2023-09-16'),
(3041, 1, '2023-09-13', 'Ольга Лебедева', '2023-09-16'),
(3042, 3, '2023-09-15', 'Алексей Смирнов', '2023-09-17'),
(3043, 4, '2023-09-16', 'Иван Иванов', '2023-09-17'),
(3044, 5, '2023-09-17', 'Алексей Смирнов', '2023-09-18'),
(3045, 6, '2023-09-18', 'Сергей Попов', '2023-09-22'),
(3046, 7, '2023-09-19', 'Ольга Лебедева', '2023-09-20'),
(3047, 8, '2023-09-20', 'Анна Михайлова', '2023-09-22'),
(3048, 9, '2023-09-21', 'Елена Ковалева', '2023-09-24'),
(3049, 2, '2023-09-24', 'Ольга Лебедева', '2023-09-26'),
(3050, 3, '2023-09-25', 'Сергей Попов', '2023-09-27'),
(3051, 5, '2023-09-27', 'Петр Петров', '2023-09-28'),
(3052, 6, '2023-09-28', 'Сергей Попов', '2023-10-02'),
(3053, 7, '2023-09-29', 'Анна Михайлова', '2023-09-30'),
(3054, 8, '2023-09-30', 'Дмитрий Федоров', '2023-10-02'),
(3055, 10, '2023-10-02', 'Иван Иванов', '2023-10-06'),
(3056, 1, '2023-10-03', 'Иван Иванов', '2023-10-06'),
(3057, 2, '2023-10-04', 'Иван Иванов', '2023-10-06'),
(3058, 4, '2023-10-06', 'Мария Сидорова', '2023-10-07'),
(3059, 5, '2023-10-07', 'Петр Петров', '2023-10-08'),
(3060, 6, '2023-10-08', 'Сергей Попов', '2023-10-12'),
(3061, 7, '2023-10-09', 'Петр Петров', '2023-10-10'),
(3062, 8, '2023-10-10', 'Иван Иванов', '2023-10-12'),
(3063, 9, '2023-10-11', 'Мария Сидорова', '2023-10-14'),
(3064, 1, '2023-10-13', 'Артем Николаев', '2023-10-16'),
(3065, 2, '2023-10-14', 'Дмитрий Федоров', '2023-10-16'),
(3066, 3, '2023-10-15', 'Анна Михайлова', '2023-10-17'),
(3067, 4, '2023-10-16', 'Сергей Попов', '2023-10-17'),
(3068, 5, '2023-10-17', 'Мария Сидорова', '2023-10-18'),
(3069, 6, '2023-10-18', 'Артем Николаев', '2023-10-22'),
(3070, 7, '2023-10-19', 'Артем Николаев', '2023-10-20'),
(3071, 8, '2023-10-20', 'Анна Михайлова', '2023-10-22'),
(3072, 9, '2023-10-21', 'Сергей Попов', '2023-10-24'),
(3073, 10, '2023-10-22', 'Анна Михайлова', '2023-10-26');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `regions`
--
ALTER TABLE `regions`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `trips`
--
ALTER TABLE `trips`
  ADD PRIMARY KEY (`id`),
  ADD KEY `region_id` (`region_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `regions`
--
ALTER TABLE `regions`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT для таблицы `trips`
--
ALTER TABLE `trips`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3074;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `trips`
--
ALTER TABLE `trips`
  ADD CONSTRAINT `trips_ibfk_1` FOREIGN KEY (`region_id`) REFERENCES `regions` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
